movingBlock/movingBlock_meshmotion/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     moveDynamicMesh;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         13;

deltaT          0.5;

writeControl    runTime;

writeInterval   1.0;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep no;

maxCo 0.5;

function
{
/*
    coefficient
    {
	    type	forceCoeffs;
	    libs	("libforces.so");
	    writeControl timeStep;
	    patches	(block);
	    CofR	(0.5 0 0);
	    log 	on;
	    rho		rhoInf;
	    rhoInf	1;
	    liftDir	(0 1 0);
	    dragDir	(-1 0 0);
	    pitchAxis	(0 0 1);
	    lRef 	1.0;
	    Aref	1.0;
    }

    vorticity
    {
	    type	vorticity;
	    libs	(fieldFunctionObjects);
	    writeControl	writeTime;
    }

*/
}
// ************************************************************************* //
